//'number' + 23 + 32
//'number' + 23 = number23 + 32 = number2332 
//(виконується тип данних string)

//41 + 1 + 'number'
//41+1 = 42 + 'number' = 42number 
//(спочатку виконується тип данних number, другою дією додається string, в кінці отримуємо string)

//null + 1
//resolt = 1 
//(null-немає значення + 1 відповідно буде 1)

//'five' + + 'two'
//resolt = 'fiveNan'
//(спочатку виконується операція унарний плюс, результатом якої буде Nan, далі йде операція конкатенація)

//2 && 7
//resolt = 7 
//(якщо перший операнд правдивий, І повертає другий операнд)

//+'40' + +'2'
//resolt = 42
//(префіксний інкремент, значення додаються)

//'10' - 5 === 6
//resolt = false
//(спочатку виконується операція віднімання, в результаті отримуємо 5, далі оператор порівняння 5 не дорів.6 дає в результаті false)

//true + false
//resolt = 1 
//(true = 1, false = 0, resolt = 1) 

//'4px' - 3
//resolt = Nan
//(Number не може перетворити строку на число)

//'4' - 3
//resolt = 1
//(відбулося перетворення строки на число, відповідно операція віднімання)

//'2' + 3 ** 2
//resolt = '29'
//(спочатку виконується діє взведення в ступінь, далі неявне перетворення конкатенація)

//12 / '6'
//resolt = 2
//(виконується ділення, Number)

//23 + 42 + 'number'
//resolt = '65number'
//(спочатку додавання чисел, далі додавання строки)

//'10' + (5 === 6)
//resolt = '10false'
//(спочатку виконується операція порівняння, 5 не дорів. 6 тому false, і подальше додавання строк)

//'number' + 15 + 3
//resolt = 'number153'
//(відбувається додавання строк)